<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<TITLE>Como Relatar Bugs De Maneira Eficaz</TITLE>
<meta content="text/html; charset=iso-8859-1" http-equiv="Content-Type">
</HEAD>
<BODY>
<H2>Como Relatar Bugs De Maneira Eficaz</H2>
<p><em>por Simon Tatham,
programador professional e de softwares de código-livre. Tradução
para o portugu&ecirc;s por
<a href="http://www.celiojunior.com.br">CJr</a>.</em></p>

<p>[
<a href="/tatham/en.html">English</a>
|
<b>Portugu&ecirc;s</b>
|
<a href="/tatham/cn.html">&#31616;&#20307;&#20013;&#25991;</a>
|
<a href="/tatham/cz.html">&#268;esky</a>
|
<a href="/tatham/da.html">Dansk</a>
|
<a href="/tatham/de.html">Deutsch</a>
|
<a href="/tatham/es.html">Espa&ntilde;ol</a>
|
<a href="/tatham/fr.html">Fran&ccedil;ais</a>
|
<a href="/tatham/hu.html">Magyar</a>
|
<a href="/tatham/it.html">Italiano</a>
|
<a href="/tatham/jp.html">&#26085;&#26412;&#35486;</a>
|
<a href="/tatham/nl.html">Nederlands</a>
|
<a href="/tatham/pl.html">Polski</a>
|
<a href="/tatham/ru.html">&#1056;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081;</a>
|
<a href="/tatham/tw.html">&#32321;&#39636;&#20013;&#25991;</a>
]

<H3><A NAME="s1">Introdu&ccedil;&atilde;o</A></H3>
<P>Qualquer um que tenha escrito software para uso p&uacute;blico provavelmente recebeu ao menos um relat&oacute;rio de bugs ruim. Relat&oacute;rios que n&atilde;o dizem nada ("Isso n&atilde;o funciona!"); relat&oacute;rios que n&atilde;o fazem sentido; relat&oacute;rios que trazem informa&ccedil;&otilde;es <em>erradas</em>. Relat&oacute;rios contendo problemas que acabam por ser identificados como erros de usu&aacute;rio; relat&oacute;rios de problemas que acabam sendo identificados como falhas de um programa externo; relat&oacute;rios de problemas que acabam sendo identificados como falhas de rede.</P>
<P>Existe uma raz&atilde;o pela qual o suporte t&eacute;cnico &eacute; visto como um trabalho horr&iacute;vel para se fazer, e esta raz&atilde;o s&atilde;o os relat&oacute;rios de bugs ruins. Entretanto, nem todos os relat&oacute;rios de bug s&atilde;o desagrad&aacute;veis: eu mantenho software livre quando n&atilde;o estou ganhando a vida, e algumas vezes recebo relat&oacute;rios de bug maravilhosamente claros, &uacute;teis, <em>informativos</em>.</P>
<P>Neste ensaio vou tentar identificar claramente o que faz um relat&oacute;rio de bugs ser bom. Idealmente, eu gostaria que todo o mundo lesse esse ensaio antes de fazer qualquer relat&oacute;rio de bug para qualquer um. Certamente eu gostaria que todos os que fizessem relat&oacute;rios de bug para <em>mim</em> o lessem.</P>
<P>Sinteticamente, o objetivo de um relatorio de bug &eacute; tornar os programadores capazes de ver a falha do programa acontecer em frente aos seus olhos. Voc&ecirc; pode mostrar a eles pessoalmente, ou fornecer-lhes instru&ccedil;&otilde;es detalhadas e cuidadosas sobre como fazer o programa falhar. Se eles puderem faz&ecirc;-lo falhar, tentar&atilde;o obter informa&ccedil;&otilde;es extras at&eacute; descobrirem a causa da falha. Se eles n&atilde;o podem faz&ecirc;-lo falhar, v&atilde;o ter que pedir a voc&ecirc; para conseguir essas informa&ccedil;&otilde;es para eles.</P>
<P>Quando fizer relat&oacute;rios de bug, tente fazer uma distin&ccedil;&atilde;o muito clara entre os fatos reais ("Eu estava no computador e isso aconteceu") e especula&ccedil;&otilde;es ("Eu <em>acho</em> que o problema pode ser esse"). Se quiser, deixe de fora as especula&ccedil;&otilde;es, mas n&atilde;o os fatos.</P>
<P>Quando voc&ecirc; relata um bug, &eacute; porque deseja que ele seja consertado. N&atilde;o faz sentido massacrar os programadores ou ser deliberadamente obscuro: o erro pode ser deles e o problema seu, e voc&ecirc; pode estar certo em estar com raiva deles, mas o bug vai ser consertado mais rapidamente se voc&ecirc; ajud&aacute;-los fornecendo todas as informa&ccedil;&otilde;es de que eles precisam. Lembre-se tamb&eacute;m de que se o programa &eacute; gratuito, ent&atilde;o os autores est&atilde;o fornecendo-o por bondade. Se muitas pessoas forem rudes com eles, eles podem deixar de ser bons. </P>

<H3><A NAME="issonaofunciona">&quot;Isso n&atilde;o funciona.&quot;</A></H3>
<P>D&ecirc; aos programadores o cr&eacute;dito de possu&iacute;rem uma intelig&ecirc;ncia de n&iacute;vel b&aacute;sico: se o programa realmente n&atilde;o tem nada que funcione, eles provavelmente teriam notado. Como n&atilde;o notaram, ele tem que estar funcionando com eles. Portanto, ou voc&ecirc; est&aacute; fazendo alguma coisa diferente do que eles fazem ou seu ambiente &eacute; diferente do deles. Eles precisam de informa&ccedil;&atilde;o; fornecer essa informa&ccedil;&atilde;o &eacute; o prop&oacute;sito de um relat&oacute;rio de bug. Mais informa&ccedil;&atilde;o &eacute; quase sempre melhor que menos informa&ccedil;&atilde;o.</P>
<P>Muitos programadores, particularmente os que trabalham em softwares livres ou gratuitos, publicam suas listas de bugs conhecidos. Se voc&ecirc; encontrar uma lista de bugs conhecidos, vale a pena l&ecirc;-la para verificar se o bug que voc&ecirc; encontrou j&aacute; &eacute; conhecido. Se j&aacute; &eacute;, provavelmente n&atilde;o vale a pena relat&aacute;-lo novamente, mas se voc&ecirc; acha que tem mais informa&ccedil;&otilde;es para fornecer do que as que constam na lista, deve entrar em contato os programadores. Eles podem consertar o bug mais facilmente se voc&ecirc; puder fornecer a eles informa&ccedil;&otilde;es que eles ainda n&atilde;o t&ecirc;m.</P>
<P>Este ensaio est&aacute; cheio de diretrizes. Nenhuma delas &eacute; uma regra absoluta. Programadores espec&iacute;ficos gostam de maneiras espec&iacute;ficas de relatar bugs. Se o programa vem com diretrizes pr&oacute;prias sobre como relatar bugs, leia-as. Se as dicas que vem com o programa contradizem as descritas neste ensaio, siga-as!</P>
<P>Se voc&ecirc; n&atilde;o est&aacute; relatando um bug, mas apenas pedindo ajuda para utilizar o programa, deveria deixar claro que j&aacute; procurou pela resposta para a sua pergunta (&quot;Li a se&ccedil;&atilde;o 5.2 e o cap&iacute;tulo 4, mas n&atilde;o encontrei nada que me dissesse se o que quero fazer &eacute; poss&iacute;vel.&quot;) Isto vai permitir aos programadores saber como as pessoas esperam encontrar as respostas, e assim eles poder&atilde;o fazer com que a documenta&ccedil;&atilde;o fique mais f&aacute;cil de usar.</P>
<H3><A NAME="s3">&quot;Mostre-me.&quot;</A></H3>
<P>Uma das melhores maneiras de relatar bugs &eacute; mostr&aacute;-los aos programadores. Coloque-os em frente ao seu computador, inicie o software e demonstre o erro. Deixe-os observar como voc&ecirc; inicia a m&aacute;quina, como voc&ecirc; executa o software e interage com ele e tamb&eacute;m o que o software faz em resposta &agrave;s suas entradas.</P>
<P>Eles sabem que o software gosta deles. Sabem quais as partes dele em que confiam, e sabem quais as que mais provavelmente contem falhas. Sabem intuitivamente o que esperar. Quando o software faz alguma coisa obviamente errada, eles j&aacute; podem ter notado algo <em>sutilmente</em> errado que aconteceu antes disso, e que pode lhes fornecer uma pista. Podem observar tudo que o computador faz durante a execu&ccedil;&atilde;o do teste, e escolher as informa&ccedil;&otilde;es relevantes por si mesmos.</P>
<P>Isso pode n&atilde;o ser o suficiente. Eles podem decidir que precisam de mais informa&ccedil;&otilde;es, e pedir a voc&ecirc; para mostrar tudo de novo. Podem pedir a voc&ecirc; para ensin&aacute;-los a realizar os passos do teste, e assim podem reproduzir o bug para si mesmos quantas vezes desejarem. Podem tentar variar os passos por algumas vezes,  para verificar se o problema ocorre apenas em um caso ou em uma fam&iacute;lia de casos relacionados. Se voc&ecirc; for azarado, eles podem precisar usar ferramentas de desenvolvimento por algumas horas e <em>realmente</em> come&ccedil;ar a investigar. Mais a coisa mais importante &eacute; t&ecirc;-los olhando para o computador quando o erro acontecer. Uma vez que eles possam ver o problema acontecendo, usualmente podem sair dali e come&ccedil;ar a consert&aacute;-lo.</P>
<H3><A NAME="s3">&quot;Mostre-me como mostrar a mim mesmo&quot;</A></H3>
<P>Esta &eacute; a era da Internet. Esta &eacute; a era das comunica&ccedil;&otilde;es globais. Esta &eacute; a era em que eu posso enviar meu software para algu&eacute;m na R&uacute;ssia com o toque de um bot&atilde;o, e essa pessoa pode me enviar coment&aacute;rios sobre ele com a mesma facilidade. Mas se essa pessoa verifica um problema com o meu programa, ela<em> n&atilde;o pode</em> me ter em frente ao computador quando ele ocorre. &quot;Mostre-me&quot; &eacute; bom quando voc&ecirc; pode, mas voc&ecirc; muitas vezes n&atilde;o pode.</P>
<P>Se voc&ecirc; tem que reportar um bug para um programador que n&atilde;o pode estar com voc&ecirc; pessoalmente, o objetivo do exerc&iacute;cio &eacute; capacit&aacute;-lo a <em>reproduzir</em> o problema. Voc&ecirc; quer que o programador execute a sua pr&oacute;pria c&oacute;pia do programa, faca as mesmas coisas que voc&ecirc; fez com ele e fa&ccedil;a-o falhar da mesma maneira. Quando eles podem ver o problema acontecendo em frente aos seus olhos, ent&atilde;o eles podem lidar com ele.</P>
<P>Ent&atilde;o diga exatamente a eles o que voc&ecirc; fez. Se o programa tem uma interface gr&aacute;fica, diga quais bot&otilde;es voc&ecirc; pressionou e em que ordem o fez. Se for um programa que voc&ecirc; executa digitando um comando, mostre a eles precisamente que comando voc&ecirc; digitou. Sempre que poss&iacute;vel voc&ecirc; deve fornecer uma transcri&ccedil;&atilde;o fiel da sess&atilde;o, mostrando quais comandos voc&ecirc; digitou e o que o computador exibiu em resposta.</P>
<P>D&ecirc; ao programador toda a informa&ccedil;&atilde;o que voc&ecirc; puder imaginar. Se o programa l&ecirc; um arquivo, voc&ecirc; provavelmente precisa enviar uma c&oacute;pia dele. Se o programa troca dados com outro computador atrav&eacute;s de uma rede, voc&ecirc; provavelmente n&atilde;o poder&aacute; enviar uma c&oacute;pia do outro computador, mas pode ao menos dizer que tipo de computador ele &eacute;, e (se voc&ecirc; puder obter a informa&ccedil;&atilde;o) que software ele est&aacute; executando.</P>
<H3><A NAME="s3">&quot;Funciona comigo. Ent&atilde;o qual &eacute; o erro?&quot;</A></H3>
<P>Se voc&ecirc; fornecer a um programador uma longa lista de entradas e a&ccedil;&otilde;es, e ele execut&aacute;-las em sua pr&oacute;pria m&aacute;quina e nada der errado, ent&atilde;o voc&ecirc; n&atilde;o forneceu a ele informa&ccedil;&otilde;es suficientes. Possivelmente a falha n&atilde;o vai aparecer em todos os computadores; seu sistema e o dele podem ser diferentes em alguns pontos. Possivelmente voc&ecirc; entendeu mal o que o programa deveria fazer, e voc&ecirc;s est&atilde;o olhando exatamente para o mesmo resultado na tela e voc&ecirc; acha que ela est&aacute; errada e ele sabe que est&aacute; certa. </P>
<P>Ent&atilde;o, descreva tamb&eacute;m o que aconteceu. Diga a ele exatamente o que voc&ecirc; viu. Diga a ele que voc&ecirc; acha que o que viu era errado; melhor ainda, diga a ele exatamente o que voc&ecirc; esperava ver. Se voc&ecirc; disser apenas “e ent&atilde;o deu errado”, deixou de fora informa&ccedil;&otilde;es importantes. </P>
<P> Se voc&ecirc; viu mensagens de erro, diga ao programador, cuidadosa e precisamente, o que elas eram. Elas s&atilde;o importantes! Neste est&aacute;gio, o programador n&atilde;o est&aacute; tentando consertar o problema; ele est&aacute; apenas tentando encontr&aacute;-lo. Ele precisa saber o que aconteceu de errado, e estas mensagens s&atilde;o o melhor que o computador pode fazer para diz&ecirc;-lo a voc&ecirc;. Anote as mensagens se n&atilde;o houver outra maneira de se lembrar delas; n&atilde;o vale a pena relatar que o programa apresentou erros se voc&ecirc; n&atilde;o puder relatar tamb&eacute;m o conte&uacute;do das mensagens de erro. </P>
<P>Se a mensagem de erro cont&eacute;m n&uacute;meros, forne&ccedil;a-os ao programador. S&oacute; porque voc&ecirc; n&atilde;o consegue ver nenhum significado neles isso n&atilde;o significa que n&atilde;o exista algum. N&uacute;meros cont&ecirc;m todos os tipos de informa&ccedil;&atilde;o que pode ser lida por programadores, e &eacute; prov&aacute;vel que eles contenham pistas vitais. N&uacute;meros em mensagens de erro est&atilde;o l&aacute; porque o computador est&aacute; muito confuso para relatar o erro em palavras, mas est&aacute; dando o melhor de si para fornecer a voc&ecirc; a informa&ccedil;&atilde;o de algum jeito. </P>
<P>Neste est&aacute;gio, o programador est&aacute; na realidade fazendo um trabalho de detetive. Ele n&atilde;o sabe o que aconteceu, e n&atilde;o pode estar perto o suficiente para ver por si pr&oacute;prio o erro acontecer. Ele est&aacute; ent&atilde;o procurando por pistas que podem dizer o que houve. Mensagens de erro, seq&uuml;&ecirc;ncias incompreens&iacute;veis de n&uacute;meros e mesmo lentid&atilde;o inesperada s&atilde;o t&atilde;o importantes quanto impress&otilde;es digitais em uma cena de crime. Guarde-as! </P>
<P> Se voc&ecirc; est&aacute; usando Unix, o programa pode ter produzido um dump. Dumps s&atilde;o uma fonte particularmente boa de pistas, ent&atilde;o n&atilde;o os jogue fora. Por outro lado, muitos programadores n&atilde;o gostam de receber arquivos imensos de dump por email sem ser avisados disso, ent&atilde;o pe&ccedil;a permiss&atilde;o antes de enviar esses arquivos para qualquer pessoa. Esteja atento para o fato que o dump cont&eacute;m um registro de todos os dados de estado do programa: quaisquer “segredos” envolvidos (talvez o programa estivesse tratando uma mensagem pessoal, ou trabalhando com dados confidenciais) podem estar contidos no arquivo de dump. </P>
<H3><A NAME="s3">&quot;Ent&atilde;o eu tentei…&quot;</A></H3>
<P>H&aacute; v&aacute;rias coisas que voc&ecirc; pode fazer quando um erro ou bug aparece. Muitas delas tornam o problema pior. Uma das minhas amigas da faculdade apagou todos os seus arquivos do Word por engano, e, antes de chamar por ajuda especializada, tentou reinstalar o Word; depois disso, tentou rodar o Defrag. Nada disso ajudou-a a recuperar seus arquivos, e fazendo isso ela bagun&ccedil;ou de tal maneira o seu HD que nenhum programa de recupera&ccedil;&atilde;o seria capaz de recuperar nada. Se ela tivesse simplesmente deixado como estava, ela poderia ter tido uma chance de resgatar seus arquivos. </P>
<p>Usu&aacute;rios como ela s&atilde;o como uma fuinha acuada num canto: com as costas na parede e vendo a morte certa pela frente, ela ataca freneticamente, porque fazer alguma coisa tem que ser melhor do que n&atilde;o fazer nada. Esta atitude n&atilde;o &eacute; bem adaptada ao tipo de problemas que computadores produzem. </p>
<p>Ao inv&eacute;s de ser uma fuinha, seja um ant&iacute;lope. Quando um ant&iacute;lope se confronta com algo inesperado ou assustador, ele congela. Ele fica absolutamente parado e tenta n&atilde;o atrair nenhuma aten&ccedil;&atilde;o, enquanto pensa e tenta descobrir a melhor coisa a fazer. (Se houvesse suporte t&eacute;cnico para ant&iacute;lopes, eles o chamariam nestes momentos.) Ent&atilde;o, uma vez que eles tenham decidido qual &eacute; a coisa mais segura a fazer, eles a fazem. </p>
<p>Quando alguma coisa d&aacute; errado, pare imediatamente de fazer qualquer coisa. N&atilde;o clique qualquer bot&atilde;o. Olhe para a tela e tente perceber qualquer coisa fora do comum, e memorize-a ou anote-a. Ent&atilde;o, cautelosamente, pressione &quot;OK&quot; ou &quot;Cancel&quot;, o que parecer mais seguro. Tente desenvolver um ato reflexo - se um computador fizer algo inesperado, congele. </p>
<p>Se voc&ecirc; conseguir se safar do problema, seja fechando o programa afetado ou reiniciando o computador, uma boa coisa a fazer &eacute; tentar reproduzir novamente o erro. Programadores gostam de problemas que eles possam reproduzir. Programadores felizes consertam bugs mais rapidamente e com mais efic&aacute;cia. </p>
<H3><A NAME="s3">&quot;Acho que a modula&ccedil;&atilde;o do tachyon deve estar com a polariza&ccedil;&atilde;o errada.&quot;</A></H3>
<P>Maus relat&oacute;rios de bug n&atilde;o s&atilde;o produzidos somente por n&atilde;o-programadores. Alguns dos piores relat&oacute;rios que eu j&aacute; vi foram feitos por programadores, e algumas vezes por programadores. </P>
<p>Uma vez eu trabalhei com um programador que encontrava bugs em seu pr&oacute;prio c&oacute;digo e tentava consert&aacute;-los. Muitas vezes ele achava um bug que n&atilde;o conseguia resolver, e me chamava para ajudar. &quot;O que deu errado?&quot;, eu perguntava. Ele me respondia dizendo qual a sua opini&atilde;o sobre o que precisava de ser consertado. </p>
<p>Isto funcionava bem quando a opini&atilde;o dele estava certa. Isto significava que ele j&aacute; tinha feito metade do trabalho, e que conseguir&iacute;amos finalizar o restante juntos. Era eficiente e &uacute;til. </p>
<p>Mas era muito diferente quando ele estava errado. Trabalh&aacute;vamos por algum tempo tentando descobrir porque uma parte espec&iacute;fica do programa estava produzindo dados incorretos, e eventualmente descobr&iacute;amos que n&atilde;o estava, que estiv&eacute;ramos investigando c&oacute;digo perfeitamente funcional por meia hora, e que o problema real estava em outro lugar. </p>
<p>Estou certo de que ele n&atilde;o agiria assim com um m&eacute;dico. &quot;Doutor, preciso de uma receita para Hidroioiodina.&quot; As pessoas sabem que n&atilde;o podem dizer isso a um m&eacute;dico: voc&ecirc; descreve os sintomas, os desconfortos reais e as dores, as erup&ccedil;&otilde;es, as febres, e deixa o doutor fazer o diagn&oacute;stico de qual &eacute; o problema e o que fazer para resolv&ecirc;-lo. Se n&atilde;o for assim, o doutor acha que voc&ecirc; &eacute; um hipocondr&iacute;aco ou drogado e te manda embora, o que &eacute; cert&iacute;ssimo. </p>
<p>&Eacute; a mesma coisa com programadores. Fornecer seu pr&oacute;prio diagn&oacute;stico pode ser &uacute;til &agrave;s vezes, mas sempre diga os sintomas. O diagn&oacute;stico &eacute; um extra opcional e n&atilde;o uma alternativa a fornecer os sintomas. Da mesma maneira, enviar o c&oacute;digo-fonte com o conserto do problema &eacute; um acr&eacute;scimo &uacute;til a um relat&oacute;rio de bugs, mas n&atilde;o um substituto para ele. </p>
<p>Se um programador pede informa&ccedil;&atilde;o extra a voc&ecirc;, colabore! Uma vez algu&eacute;m me relatou um problema, e eu pedi a essa pessoa para executar um comando que eu sabia que n&atilde;o funcionava. Pedi isso a ela porque queria saber qual das duas mensagens de erro poss&iacute;veis o comando geraria. Saber isso forneceria uma pista vital. Mas a pessoa n&atilde;o executou o comando - ela s&oacute; me enviou um email dizendo &quot;N&atilde;o, isso n&atilde;o vai funcionar.&quot;. Levou algum tempo at&eacute; que eu a convencesse a realmente executar o comando. </p>
<p>Usar sua intelig&ecirc;ncia para ajudar os programadores &eacute; &oacute;timo. Mesmo que suas dedu&ccedil;&otilde;es estejam erradas, eles seriam gratos pela sua tentativa de tornar a vida deles mais f&aacute;cil. Mas relate os sintomas tamb&eacute;m, ou voc&ecirc; com certeza vai tornar a vida deles muito mais dif&iacute;cil. </p>
<H3><A NAME="s3">&quot;Engra&ccedil;ado, consegui fazer isso h&aacute; cinco minutos sem problemas.&quot;</A></H3>
<P>Diga “problema intermitente” para qualquer programador e veja a careta que ele faz. Os problemas f&aacute;ceis s&atilde;o aqueles onde repetir uma seq&uuml;&ecirc;ncia de passos simples vai fazer com que o erro ocorra. O programador pode ent&atilde;o repetir estas a&ccedil;&otilde;es em condi&ccedil;&otilde;es de teste bastante monitoradas e ver o que acontece com grande detalhe. Muitos problemas simplesmente n&atilde;o acontecem dessa forma: vai haver programas que falham uma vez por semana, uma vez a cada lua cheia, ou nunca falham quando voc&ecirc; tenta reproduzi-los diante do programador, mas sempre falham quando voc&ecirc; tem um prazo apertado para cumprir. </P>
<P>A maior parte dos problemas intermitentes n&atilde;o &eacute; verdadeiramente intermitente. Muitos deles t&ecirc;m uma l&oacute;gica escondida em algum lugar. Alguns ocorrem somente quando a m&aacute;quina est&aacute; com pouca mem&oacute;ria dispon&iacute;vel, alguns acontecem apenas quando outro programa tenta modificar um arquivo cr&iacute;tico no momento errado, e alguns outros ocorrer&atilde;o somente na primeira metade de cada hora! (Eu realmente vi alguns desses.) </P>
<P>Se voc&ecirc; consegue reproduzir o bug, mas o programador n&atilde;o, uma causa prov&aacute;vel &eacute; que o seu computador e o dele s&atilde;o diferentes de alguma maneira e esta diferen&ccedil;a &eacute; a causa do problema. Eu tive um programa cuja janela se enrolava em uma pequena bola no canto superior esquerdo da tela, ficava l&aacute; <em>me aborrecendo </em>. Mas ele s&oacute; fazia isso em telas com resolu&ccedil;&atilde;o de 800x600 pixels; executava normalmente em meu monitor de 1024x768. </P>
<P>O programador vai querer saber tudo o que voc&ecirc; puder descobrir sobre o problema. Tentar reproduzi-lo em outra m&aacute;quina, talvez. Tente reproduzi-lo duas ou tr&ecirc;s vezes e ver quantas vezes ele falha. Se ele acontece quando voc&ecirc; est&aacute; fazendo uma tarefa importante, mas n&atilde;o quando est&aacute; tentando demonstr&aacute;-lo, a causa da falha pode ser o grande tempo de execu&ccedil;&atilde;o ou o tratamento de grandes arquivos. Tente lembrar com quantos detalhes puder sobre o que voc&ecirc; estava fazendo quando o erro ocorreu e, se identificar padr&otilde;es, mencione-os. Tudo o que voc&ecirc; puder fornecer pode ajudar. Mesmo que seja somente uma informa&ccedil;&atilde;o probabil&iacute;stica (como “o programa tende a falhar quando o Emacs est&aacute; executando”) que n&atilde;o forne&ccedil;a pistas diretas sobre a causa do problema, ela pode ajudar o programador a reproduzir o erro. </P>
<P>Mais importante ainda, o programador vai querer estar certo de que ele est&aacute; lidando com um verdadeiro problema intermitente ou com um problema espec&iacute;fico da sua m&aacute;quina. Ele vai querer saber montes de detalhes sobre seu computador, para assim poder descobrir como o computador dele difere do seu. V&aacute;rios destes detalhes v&atilde;o depender especificamente do programa, mas algo que voc&ecirc; deve estar definitivamente pronto para fornecer s&atilde;o n&uacute;meros de vers&atilde;o. O n&uacute;mero de vers&atilde;o do programa em si, o do sistema operacional e provavelmente os de qualquer outro programa que esteja envolvido no problema. </P>
<H3><A NAME="s3">&quot;Ent&atilde;o eu carreguei o disco no meu Windows...&quot;</A></H3>
<P>Em relat&oacute;rios de bug, escrever claramente &eacute; essencial. Se o programador n&atilde;o consegue entender o que voc&ecirc; quis dizer, era prefer&iacute;vel que voc&ecirc; n&atilde;o tivesse dito nada. </P>
<p>Eu recebo relat&oacute;rios de bug de todas as partes do mundo. Muitos deles v&ecirc;m de pessoas que n&atilde;o t&ecirc;m o ingl&ecirc;s como sua l&iacute;ngua-m&atilde;e, e muitos deles pedem desculpas pelo seu ingl&ecirc;s ruim. Em geral, os relat&oacute;rios de bug que cont&ecirc;m pedidos de desculpas pelo mau ingl&ecirc;s s&atilde;o realmente claros e &uacute;teis. Todos os relat&oacute;rios mais confusos v&ecirc;m de pessoas cuja l&iacute;ngua-m&atilde;e &eacute; o ingl&ecirc;s e que presumem que eu vou entend&ecirc;-los mesmo que n&atilde;o fa&ccedil;am qualquer esfor&ccedil;o por clareza e precis&atilde;o. </p>
<ul>
  <li><em>Seja espec&iacute;fico</em>. Se voc&ecirc; puder fazer a mesma coisa de duas maneiras diferentes, diga qual delas usou. &quot;Eu selecionei a op&ccedil;&atilde;o Carregar&quot; pode significar &quot;Eu cliquei o bot&atilde;o Carregar&quot; ou &quot;Eu pressionei Alt-L&quot;. Diga qual delas voc&ecirc; usou. Algumas vezes isso &eacute; importante. </li>
  <li><em>Seja prolixo</em>. D&ecirc; mais informa&ccedil;&atilde;o ao inv&eacute;s de menos. Se voc&ecirc; der informa&ccedil;&otilde;es demais, o programador pode ignorar algumas delas. Se voc&ecirc; der informa&ccedil;&otilde;es de menos, eles tem que voltar a voc&ecirc; e perguntar mais. Uma vez tive que gastar semanas para conseguir uma quantidade de informa&ccedil;&otilde;es que fosse &uacute;til, porque elas apareciam em pequenas frases de cada vez.</li>
  <li><em>Seja cuidadoso com os pronomes</em>. N&atilde;o use palavras como &quot;isso&quot;, ou refer&ecirc;ncias como &quot;a janela&quot; quando o que elas puderem significar n&atilde;o for totalmente claro. Considere a frase: &quot;Eu iniciei o programa FooApp. Ele mostrou uma janela de advert&ecirc;ncia. Tentei fechar e ele travou.&quot; N&atilde;o est&aacute; claro o que o usu&aacute;rio tentou fechar. Foi a janela de advert&ecirc;ncia ou a aplica&ccedil;&atilde;o FooApp? Isso faz diferen&ccedil;a. Ao inv&eacute;s disso, ele poderia ter dito &quot;Eu iniciei o programa FooApp, que mostrou uma janela de advert&ecirc;ncia. Tentei fechar esta janela, e o programa travou.&quot;. Esta &uacute;ltima frase &eacute; mais longa e mais repetitiva, mas tamb&eacute;m &eacute; mais clara e menos propensa a ambiguidades. </li>
  <li><em>Leia o que voc&ecirc; escreveu</em>. Leia o relat&oacute;rio para voc&ecirc; mesmo, e verifique se o que voc&ecirc; pensou est&aacute; claro. Se voc&ecirc; fez uma lista de passos que deveriam produzir a falha, tente segui-los voc&ecirc; mesmo, para verificar se esqueceu algum deles. </li>
</ul>
<H3><A NAME="s3">Sum&aacute;rio</A></H3>
<ul>
  <li>O objetivo principal de um relat&oacute;rio de bugs &eacute; permitir que os programadores possam ver o erro com seus pr&oacute;prios olhos. Se voc&ecirc; n&atilde;o pode estar com eles pessoalmente para reproduzir a falha, d&ecirc;-lhes instru&ccedil;&otilde;es detalhadas para que  possam reproduzir a falha por si pr&oacute;prios.. </li>
  <li>No caso de o objetivo principal n&atilde;o ter sido alcan&ccedil;ado e os programadores <em>n&atilde;o puderem</em> ver a falha por si mesmos, o segundo objetivo de um relat&oacute;rio de bug &eacute; descrever o que aconteceu de errado. Descreva tudo em detalhes. Diga o que voc&ecirc; viu, e tamb&eacute;m o que esperaria ver acontecer. Escreva as mensagens de erro, especialmente se elas cont&eacute;m n&uacute;meros.</li>
  <li>Quando o seu computador fizer alguma coisa inesperada, <em>pare</em>.N&atilde;o fa&ccedil;a nada at&eacute; que esteja calmo, e n&atilde;o fa&ccedil;a nada que voc&ecirc; ache que possa ser perigoso.</li>
  <li>Tente por todos os meios diagnosticar a falha por voc&ecirc; mesmo se acha que pode faz&ecirc;-lo; mas mesmo que fa&ccedil;a isso, voc&ecirc; ainda deve relatar os sintomas.</li>
  <li>Esteja pronto para fornecer informa&ccedil;&otilde;es extras no caso de os programadores precisarem delas. Se eles n&atilde;o precisassem, n&atilde;o as pediriam. Eles n&atilde;o est&atilde;o sendo deliberadamente in&aacute;beis. Tenha os n&uacute;meros de vers&atilde;o do programa &agrave; m&atilde;o, porque provavelmente eles ser&atilde;o necess&aacute;rios.</li>
  <li>Escreva com clareza. Diga o que tem para dizer, e esteja certo de que o texto n&atilde;o possa ser mal interpretado.</li>
  <li>Acima de tudo, seja <em>preciso</em>. Programadores gostam de precis&atilde;o.</li>
</ul>
<hr>
<p><em>Aviso de nega&ccedil;&atilde;o de responsabilidade </em>: Nunca vi uma fuinha ou um ant&iacute;lope ao vivo. Minha zoologia pode ser inexata.</p>
<p>Copyright © 1999 Simon Tatham. <br>
  Este documento é <a href="http://www.opencontent.org/">OpenContent</a>. 
Voc&ecirc; pode copí&aacute;-lo e usar partes do texto nos termos da <a href="http://www.opencontent.org/opl.shtml">Licença OpenContent</a>. <br>
Por favor envie coment&aacute;rios e cr&iacute;ticas para <a href="mailto:anakin@pobox.com">anakin@pobox.com</a>. <br>
Se voc&ecirc; chegou at&eacute; est p&aacute;gina atrav&eacute;s do site de um software espec&iacute;fico, n&atilde;o envie relat&oacute;rios de bug deste software para o endere&ccedil;o acima. Retorne &agrave; p&aacute;gina em que estava e encontre nela onde reportar bugs para o software em quest&atilde;o. </p>
</BODY>
</HTML>
